zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_tim_ex.c
      /* Set TIMx_AF1 */
      htim->Instance->AF1 = tmporx;
      break;
    }
    case TIM_BREAKINPUT_BRK2:
    {
      /* Get the TIMx_AF2 register value */
      tmporx = htim->Instance->AF2;

      /* Enable the break input */
      tmporx &= ~bkin_enable_mask;
      tmporx |= (sBreakInputConfig->Enable << bkin_enable_bitpos) & bkin_enable_mask;

      /* Set the break input polarity */
      tmporx &= ~bkin_polarity_mask;
      tmporx |= (sBreakInputConfig->Polarity << bkin_polarity_bitpos) & bkin_polarity_mask;

      /* Set TIMx_AF2 */
      htim->Instance->AF2 = tmporx;
      break;
    }
    default:
      status = HAL_ERROR;
      break;
  }

  __HAL_UNLOCK(htim);

  return status;
}

/**
  * @brief  Configures the TIMx Remapping input capabilities.
  * @param  htim TIM handle.
  * @param  Remap specifies the TIM remapping source.
  *         For TIM1, the parameter can take one of the following values:
  *            @arg TIM_TIM1_ETR_GPIO            TIM1 ETR is connected to GPIO
  *            @arg TIM_TIM1_ETR_ADC1_AWD1       TIM1 ETR is connected to ADC1 AWD1
  *            @arg TIM_TIM1_ETR_ADC1_AWD2       TIM1 ETR is connected to ADC1 AWD2
  *            @arg TIM_TIM1_ETR_ADC1_AWD3       TIM1 ETR is connected to ADC1 AWD3
  *            @arg TIM_TIM1_ETR_ADC2_AWD1       TIM1 ETR is connected to ADC2 AWD1
  *            @arg TIM_TIM1_ETR_ADC2_AWD2       TIM1 ETR is connected to ADC2 AWD2
  *            @arg TIM_TIM1_ETR_ADC2_AWD3       TIM1 ETR is connected to ADC2 AWD3
  *            @arg TIM_TIM1_ETR_ADC3_AWD1       TIM1 ETR is connected to ADC3 AWD1
  *            @arg TIM_TIM1_ETR_ADC3_AWD2       TIM1 ETR is connected to ADC3 AWD2
  *            @arg TIM_TIM1_ETR_ADC3_AWD3       TIM1 ETR is connected to ADC3 AWD3
  *
  *         For TIM2, the parameter can take one of the following values:
  *            @arg TIM_TIM2_ETR_GPIO            TIM2 ETR is connected to GPIO
  *            @arg TIM_TIM2_ETR_TIM3_ETR        TIM2 ETR is connected to TIM3 ETR pin
  *            @arg TIM_TIM2_ETR_TIM4_ETR        TIM2 ETR is connected to TIM4 ETR pin
  *            @arg TIM_TIM2_ETR_TIM5_ETR        TIM2 ETR is connected to TIM5 ETR pin
  *            @arg TIM_TIM2_ETR_LSE             TIM2 ETR is connected to LSE
  *            @arg TIM_TIM2_ETR_SAI1_FSA        TIM2_ETR is connected to SAI1 FS_A
  *            @arg TIM_TIM2_ETR_SAI1_FSB        TIM2_ETR is connected to SAI1 FS_B
  *            @arg TIM_TIM2_ETR_ETH1_PPS        TIM2_ETR is connected to ETH1 PPS
  *            @arg TIM_TIM2_ETR_ETH2_PPS        TIM2_ETR is connected to ETH2 PPS
  *
  *         For TIM3, the parameter can take one of the following values:
  *            @arg TIM_TIM3_ETR_GPIO            TIM3_ETR is not connected to I/O
  *            @arg TIM_TIM3_ETR_TIM2_ETR        TIM3_ETR is connected to TIM2 ETR
  *            @arg TIM_TIM3_ETR_TIM4_ETR        TIM3_ETR is connected to TIM4 ETR
  *            @arg TIM_TIM3_ETR_TIM5_ETR        TIM3_ETR is connected to TIM5 ETR
  *            @arg TIM_TIM3_ETR_ETH1_PPS        TIM3_ETR is connected to ETH1 PPS
  *            @arg TIM_TIM3_ETR_ETH2_PPS        TIM3_ETR is connected to ETH2 PPS
  *
  *         For TIM4, the parameter can take one of the following values:
  *            @arg TIM_TIM4_ETR_GPIO            TIM4 ETR is connected to GPIO
  *            @arg TIM_TIM4_ETR_TIM2_ETR        TIM4_ETR is connected to TIM2 ETR
  *            @arg TIM_TIM4_ETR_TIM3_ETR        TIM4_ETR is connected to TIM3 ETR
  *            @arg TIM_TIM4_ETR_TIM5_ETR        TIM4_ETR is connected to TIM5 ETR
  *
  *         For TIM5, the parameter can take one of the following values:
  *            @arg TIM_TIM5_ETR_GPIO            TIM5 ETR is connected to GPIO
  *            @arg TIM_TIM5_ETR_TIM2_ETR        TIM5_ETR is connected to TIM2 ETR
  *            @arg TIM_TIM5_ETR_TIM3_ETR        TIM5_ETR is connected to TIM3 ETR
  *            @arg TIM_TIM5_ETR_TIM3_ETR        TIM5_ETR is connected to TIM4 ETR
  *            @arg TIM_TIM5_ETR_SAI2_FSA        TIM5_ETR is connected to SAI2 FS_A
  *            @arg TIM_TIM5_ETR_SAI2_FSB        TIM5_ETR is connected to SAI2 FS_B
  *            @arg TIM_TIM5_ETR_USBHS_SOF       TIM5_ETR is connected to USBHS SOF
  *
  *         For TIM8, the parameter can take one of the following values:
  *            @arg TIM_TIM8_ETR_GPIO            TIM8 ETR is connected to GPIO
  *            @arg TIM_TIM8_ETR_ADC1_AWD1       TIM8_ETR is connected to ADC1 AWD1
  *            @arg TIM_TIM8_ETR_ADC1_AWD2       TIM8_ETR is connected to ADC1 AWD2
  *            @arg TIM_TIM8_ETR_ADC1_AWD3       TIM8_ETR is connected to ADC1 AWD3
  *            @arg TIM_TIM8_ETR_ADC2_AWD1       TIM8_ETR is connected to ADC2 AWD1
  *            @arg TIM_TIM8_ETR_ADC2_AWD2       TIM8_ETR is connected to ADC2 AWD2
  *            @arg TIM_TIM8_ETR_ADC3_AWD3       TIM8_ETR is connected to ADC2 AWD3
  *            @arg TIM_TIM8_ETR_ADC3_AWD1       TIM8_ETR is connected to ADC3 AWD1
  *            @arg TIM_TIM8_ETR_ADC3_AWD2       TIM8_ETR is connected to ADC3 AWD2
  *            @arg TIM_TIM8_ETR_ADC3_AWD3       TIM8_ETR is connected to ADC3 AWD3
  *
  *         For TIM20, the parameter can take one of the following values:
  *            @arg TIM_TIM20_ETR_GPIO           TIM20 ETR is connected to GPIO
  *            @arg TIM_TIM20_ETR_ADC1_AWD1      TIM20_ETR is connected to ADC1 AWD1
  *            @arg TIM_TIM20_ETR_ADC1_AWD2      TIM20_ETR is connected to ADC1 AWD2
  *            @arg TIM_TIM20_ETR_ADC1_AWD3      TIM20_ETR is connected to ADC1 AWD3
  *            @arg TIM_TIM20_ETR_ADC2_AWD1      TIM20_ETR is connected to ADC2 AWD1
  *            @arg TIM_TIM20_ETR_ADC2_AWD2      TIM20_ETR is connected to ADC2 AWD2
  *            @arg TIM_TIM20_ETR_ADC3_AWD3      TIM20_ETR is connected to ADC2 AWD3
  *            @arg TIM_TIM20_ETR_ADC3_AWD1      TIM20_ETR is connected to ADC3 AWD1
  *            @arg TIM_TIM20_ETR_ADC3_AWD2      TIM20_ETR is connected to ADC3 AWD2
  *            @arg TIM_TIM20_ETR_ADC3_AWD3      TIM20_ETR is connected to ADC3 AWD3

  *
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIMEx_RemapConfig(TIM_HandleTypeDef *htim, uint32_t Remap)
{
  /* Check parameters */
  assert_param(IS_TIM_REMAP_INSTANCE(htim->Instance));
  assert_param(IS_TIM_REMAP(htim->Instance, Remap));

  __HAL_LOCK(htim);

  MODIFY_REG(htim->Instance->AF1, TIM1_AF1_ETRSEL_Msk, Remap);

  __HAL_UNLOCK(htim);

  return HAL_OK;
}

/**
  * @brief  Select the timer input source
  * @param  htim TIM handle.
  * @param  Channel specifies the TIM Channel
  *          This parameter can be one of the following values:
  *            @arg TIM_CHANNEL_1: TI1 input channel
  *            @arg TIM_CHANNEL_2: TI2 input channel
  * @param  TISelection parameter of the TIM_TISelectionStruct structure is detailed as follows:
  *         For TIM5, the parameter is one of the following values:
  *            @arg TIM_TIM5_TI1_GPIO                 TIM5_TI1 is connected to GPIO
  *            @arg TIM_TIM5_TI1_FDCAN_TMP            TIM5_TI1 is connected to FDCAN TMP
  *            @arg TIM_TIM5_TI1_FDCAN_RTP            TIM5_TI1 is connected to FDCAN RTP
  *
  *         For TIM12, the parameter is one of the following values:
  *            @arg TIM_TIM12_TI1_GPIO                TIM12_TI1 is connected to GPIO
  *            @arg TIM_TIM12_TI1_MSI_256             TIM12_TI1 is connected to MSI/256
  *            @arg TIM_TIM12_TI1_HSI_1024            TIM12_TI1 is connected to HSI/1024
  *
  *         For TIM15, the parameter is one of the following values:
  *            @arg TIM_TIM15_TI1_GPIO                TIM15_TI1 is connected to GPIO
  *            @arg TIM_TIM15_TI1_TIM2_CH1            TIM15_TI1 is connected to TIM2 CH1 GPIO
  *            @arg TIM_TIM15_TI1_TIM3_CH1            TIM15_TI1 is connected to TIM3 CH1 GPIO
  *            @arg TIM_TIM15_TI1_TIM4_CH1            TIM15_TI1 is connected to TIM4 CH1 GPIO
  *            @arg TIM_TIM15_TI1_CSE                 TIM15_TI1 is connected to CSE
  *            @arg TIM_TIM15_TI1_CSI                 TIM15_TI1 is connected to CSI
  *            @arg TIM_TIM15_TI1_MCO2                TIM15_TI1 is connected to MCO2
  *            @arg TIM_TIM15_TI1_CSI_256             TIM15_TI1 is connected to CSI/256
  *            @arg TIM_TIM15_TI1_HSI_1024            TIM15_TI1 is connected to HSI/1024
  *            @arg TIM_TIM15_TI2_GPIO                TIM15_TI2 is connected to GPIO
  *            @arg TIM_TIM15_TI2_TIM2_CH1            TIM15_TI2 is connected to TIM2 CH2 GPIO
  *            @arg TIM_TIM15_TI2_TIM3_CH1            TIM15_TI2 is connected to TIM3 CH2 GPIO
  *            @arg TIM_TIM15_TI2_TIM4_CH1            TIM15_TI2 is connected to TIM4 CH2 GPIO
  *
  *         For TIM16, the parameter is one of the following values:
  *            @arg TIM_TIM16_TI1_GPIO                TIM16_TI1 is connected to GPIO
  *            @arg TIM_TIM16_TI1_LSI                 TIM16_TI1 is connected to LSI
  *            @arg TIM_TIM16_TI1_LSE                 TIM16_TI1 is connected to LSE
  *            @arg TIM_TIM16_TI1_RTC_WKUP            TIM16_TI1 is connected to RTC Wakeup
  *
  *         For TIM17, the parameter is one of the following values:
  *            @arg TIM_TIM17_TI1_GPIO                TIM17_TI1 is connected to GPIO
  *            @arg TIM_TIM17_TI1_SPDIF_FS            TIM17_TI1 is connected to SPDIFRX FS
  *            @arg TIM_TIM17_TI1_HSE_RTC             TIM17_TI1 is connected to HSE_RTC
  *            @arg TIM_TIM17_TI1_MCO1                TIM17_TI1 is connected to MCO1
  * @retval HAL status
  */
HAL_StatusTypeDef  HAL_TIMEx_TISelection(TIM_HandleTypeDef *htim, uint32_t TISelection, uint32_t Channel)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  assert_param(IS_TIM_TISEL_INSTANCE(htim->Instance));
  assert_param(IS_TIM_TISEL(TISelection));

  __HAL_LOCK(htim);

  switch (Channel)
  {
    case TIM_CHANNEL_1:
      MODIFY_REG(htim->Instance->TISEL, TIM_TISEL_TI1SEL, TISelection);
      break;
    case TIM_CHANNEL_2:
      MODIFY_REG(htim->Instance->TISEL, TIM_TISEL_TI2SEL, TISelection);
      break;
    case TIM_CHANNEL_3:
      MODIFY_REG(htim->Instance->TISEL, TIM_TISEL_TI3SEL, TISelection);
      break;
    case TIM_CHANNEL_4:
      MODIFY_REG(htim->Instance->TISEL, TIM_TISEL_TI4SEL, TISelection);
      break;
    default:
      status = HAL_ERROR;
      break;
  }

  __HAL_UNLOCK(htim);

